qe-harness/harness/jmeter/tst-021-ledger/plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="TST-021 Ledger Invariant" enabled="true">
      <stringProp name="TestPlan.comments">Task 16 (Wave 16 QE Harness). See README.md for the invariants (I1-I3) this plan asserts.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Content-Type: application/json" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- setUp Thread Group: resets the ledger tables and creates the two
           accounts the load below transfers between, before the main
           Thread Group's first request; same TRUNCATE ... RESTART
           IDENTITY CASCADE pattern reference-sut's own
           AbstractLedgerIntegrationTest#resetLedgerFixture() uses.
           Necessary, not just tidy: GET /ledger/trial-balance nets EVERY
           ledger_entry row ever written, with no scoping to "this run's
           transfers" and no reset endpoint of its own, so a prior
           defect-active run's unbalanced entries would otherwise poison
           every later clean run's I1/I2 result permanently (confirmed
           empirically: a clean run immediately after an unbalanced one,
           without this reset, still reported I1/I2 FAILED). -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Reset and Seed Accounts" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stopthread</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </SetupThreadGroup>
      <hashTree>

        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Reset and Seed Ledger Accounts" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
import java.sql.Connection
import java.sql.DriverManager

String url = System.getenv("LEDGER_JDBC_URL")
String user = System.getenv("LEDGER_JDBC_USER")
String password = System.getenv("LEDGER_JDBC_PASSWORD")

Connection conn = DriverManager.getConnection(url, user, password)
try {
    def st = conn.createStatement()
    try {
        st.executeUpdate("TRUNCATE TABLE ledger_entry, account RESTART IDENTITY CASCADE")
        st.executeUpdate("INSERT INTO account (account_ref, party_name) VALUES ('ACC-000001', 'Test Fixture Debtor Co')")
        st.executeUpdate("INSERT INTO account (account_ref, party_name) VALUES ('ACC-000002', 'Test Fixture Creditor Co')")
    } finally {
        st.close()
    }
} finally {
    conn.close()
}
SampleResult.setSuccessful(true)
SampleResult.setResponseData("reset ledger_entry/account, seeded ACC-000001/ACC-000002", "UTF-8")
SampleResult.setResponseCode("200")
]]></stringProp>
        </JSR223Sampler>
        <hashTree/>

      </hashTree>

      <!-- Main Thread Group: concurrent POST /transfers between the two
           seeded accounts. The Synchronizing Timer forces every thread to
           arrive together before any of them fires its request, so this
           genuinely exercises TransferService's concurrent-lock-ordering
           path (see TransferService's javadoc) instead of threads
           trickling in one at a time under ramp-up alone. -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Transfer Load" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">8</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Timer" enabled="true">
          <intProp name="groupSize">8</intProp>
          <longProp name="timeoutInMs">10000</longProp>
        </SyncTimer>
        <hashTree/>

        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Compute Transfer Params" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
int threadNum = ctx.getThreadNum()
int iter = vars.getIteration()
boolean forward = ((threadNum + iter) % 2 == 0)
vars.put("fromAcc", forward ? "ACC-000001" : "ACC-000002")
vars.put("toAcc", forward ? "ACC-000002" : "ACC-000001")
long amountMinor = 100L + ((threadNum * 7L + iter * 13L) % 900L)
vars.put("amountMinor", String.valueOf(amountMinor))
]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /transfers" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"from":"${fromAcc}","to":"${toAcc}","amountMinor":${amountMinor}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/transfers</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>

      </hashTree>

      <!-- TearDown Thread Group: runs once, after every Transfer Load
           thread has finished (JMeter guarantees a TearDown Thread Group
           starts only once the main test's thread groups have completed;
           see plan's README.md "why teardown, not mid-run"). Single
           thread, single loop ; there is exactly one trial balance to
           check, not one per virtual user. -->
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="Verify Ledger" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </PostThreadGroup>
      <hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /ledger/trial-balance" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/ledger/trial-balance</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>

          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="extract-trial-balance" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

def json = new JsonSlurper().parseText(prev.getResponseDataAsString())
vars.put("ledger_netMinor", json.netMinor.toString())
vars.put("ledger_entryCount", json.entryCount.toString())
]]></stringProp>
          </JSR223PostProcessor>
          <hashTree/>

        </hashTree>

        <!-- assert-trial-balance.groovy (Task 16 deliverable) evaluates
             I1-I3 against ledger_netMinor (extracted above) and a direct
             Postgres query, then calls EvidenceEmitter ; see that file's
             own header comment. Loaded by absolute path (resolved via
             System.getenv, not a relative "src/test/jmeter"-copied path)
             so it works the same whether jmeter-maven-plugin copies test
             files into target/ or not. -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="assert-trial-balance" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="filename">${__groovy(System.getenv("ASSERT_SCRIPT_PATH"),)}</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>

      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>